
import os
import time

import pygame

import random


songSTARTtime = 0
songpos = 0

DOGMATICAlyricnum = 0

DOGMATICArenderednum = -1

BE_AMCSLASH = ["    \n",                     #0
               "    \n",                     #1
               "    \n",                     #2
               "    .s5SSSs.  .s5SSSs.  \n", #3
               "          SS.       SS. \n", #4
               "    sS    S%S sS    `:; \n", #5
               "    SS    S%S SS        \n", #6
               "    SS .sSSS  SSSs.     \n", #7
               "    SS    S%S SS        \n", #8
               "    SS    `:; SS        \n", #9
               "    SS    ;,. SS    ;,. \n", #10
               "    `:;;;;;:' `:;;;;;:' \n", #11
               "    \n",                     #12
               "    \n",                     #13
               "    \n",]                    #14

BE_AMCAAA01 = ["     .S_SSSs      sSSs  \n", #0
               "    .SS~SSSSS    d%%SP  \n", #1
               "    S%S   SSSS  d%S'    \n", #2
               "    S%S    S%S  S%S     \n", #3
               "    S%S SSSS%P  S&S     \n", #4
               "    S&S  SSSY   S&S_Ss  \n", #5
               "    S&S    S&S  S&S~SP  \n", #6
               "    S&S    S&S  S&S~SP  \n", #7
               "    S&S    S&S  S&S     \n", #8
               "    S*S    S&S  S*b     \n", #9
               "    S*S    S*S  S*S.    \n", #10
               "    S*S SSSSP    SSSbs  \n", #11
               "    S*S  SSY      YSSP  \n", #12
               "    SP                  \n", #13
               "    Y                   \n",]#14

KEEP_AMCAAA01 = ["     .S    S.     sSSs    sSSs   .S_sSSs    \n", #0                 
                 "    .SS    SS.   d%%SP   d%%SP  .SS~YS%%b   \n", #1
                 "    S%S    S&S  d%S'    d%S'    S%S   `S%b  \n", #2
                 "    S%S    d*S  S%S     S%S     S%S    S%S  \n", #3
                 "    S&S   .S*S  S&S     S&S     S%S    d*S  \n", #4
                 "    S&S_sdSSS   S&S_Ss  S&S_Ss  S&S   .S*S  \n", #5
                 "    S&S~YSSY%b  S&S~SP  S&S~SP  S&S_sdSSS   \n", #6
                 "    S&S    `S%  S&S     S&S     S&S~YSSY    \n", #7
                 "    S*S     S%  S*b     S*b     S*S         \n", #8
                 "    S*S     S&  S*S.    S*S.    S*S         \n", #9
                 "    S*S     S&   SSSbs   SSSbs  S*S         \n", #10
                 "    S*S     SS    YSSP    YSSP  S*S         \n", #11
                 "    SP                          SP          \n", #12
                 "    Y                           Y           \n",]#13

BEFORE_BLURVISIONASCII = [
    "░▒▓███████▓▒░░▒▓████████▓▒░▒▓████████▓▒░▒▓██████▓▒░░▒▓███████▓▒░░▒▓████████▓▒░ \n", #0
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #1
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #2
    "░▒▓███████▓▒░░▒▓██████▓▒░ ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓███████▓▒░░▒▓██████▓▒░   \n", #3
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #4
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #5
    "░▒▓███████▓▒░░▒▓████████▓▒░▒▓█▓▒░      ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░ \n", #6
]

OH_ANSIREGULAR = [
    "     ██████  ██   ██ \n", #0
    "    ██    ██ ██   ██ \n", #1
    "    ██    ██ ███████ \n", #2
    "    ██    ██ ██   ██ \n", #3
    "     ██████  ██   ██ \n", #4
]
MY_ANSIREGULAR = [
    "    ███    ███ ██    ██ \n", #0
    "    ████  ████  ██  ██  \n", #1
    "    ██ ████ ██   ████   \n", #2
    "    ██  ██  ██    ██    \n", #3
    "    ██      ██    ██    \n", #4
]
GOD_ANSIREGULAR = [
    "     ██████   ██████  ██████  \n", #0
    "    ██       ██    ██ ██   ██ \n", #1
    "    ██   ███ ██    ██ ██   ██ \n", #2
    "    ██    ██ ██    ██ ██   ██ \n", #3
    "     ██████   ██████  ██████  \n", #4
]
SHUT_THEEDGE = [
    "       ▄▄▄▄▄    ▄  █   ▄     ▄▄▄▄▀ \n", #0
    "      █     ▀▄ █   █    █ ▀▀▀ █    \n", #1
    "    ▄  ▀▀▀▀▄   ██▀▀█ █   █    █    \n", #2
    "     ▀▄▄▄▄▀    █   █ █   █   █     \n", #3
    "                  █  █▄ ▄█  ▀      \n", #4
    "                 ▀    ▀▀▀          \n", #5
]
THE_THIS = [
    "     ▄▀▀▀█▀▀▄  ▄▀▀▄ ▄▄   ▄▀▀█▄▄▄▄ \n", #0
    "    █    █  ▐ █  █   ▄▀ ▐  ▄▀   ▐ \n", #1
    "    ▐   █     ▐  █▄▄▄█    █▄▄▄▄▄  \n", #2
    "       █         █   █    █    ▌  \n", #3
    "     ▄▀         ▄▀  ▄▀   ▄▀▄▄▄▄   \n", #4
    "    █          █   █     █    ▐   \n", #5
    "    ▐          ▐   ▐     ▐        \n", #6
]
FUCK_THIS = [
    "     ▄▀▀▀█▄    ▄▀▀▄ ▄▀▀▄  ▄▀▄▄▄▄   ▄▀▀▄ █ \n", #0
    "    █  ▄▀  ▀▄ █   █    █ █ █    ▌ █  █ ▄▀ \n", #1
    "    ▐ █▄▄▄▄   ▐  █    █  ▐ █      ▐  █▀▄  \n", #2
    "     █    ▐     █    █     █        █   █ \n", #3
    "     █           ▀▄▄▄▄▀   ▄▀▄▄▄▄▀ ▄▀   █  \n", #4
    "    █                    █     ▐  █    ▐  \n", #5
    "    ▐                    ▐        ▐       \n", #6
]
UP_BLOODY = [
    "     █    ██  ██▓███   ▐██▌ \n", #0
    "     ██  ▓██▒▓██░  ██▒ ▐██▌ \n", #1
    "    ▓██  ▒██░▓██░ ██▓▒ ▐██▌ \n", #2
    "    ▓▓█  ░██░▒██▄█▓▒ ▒ ▓██▒ \n", #3
    "    ▒▒█████▓ ▒██▒ ░  ░ ▒▄▄  \n", #4
    "    ░▒▓▒ ▒ ▒ ▒▓▒░ ░  ░ ░▀▀▒ \n", #5
    "    ░░▒░ ░ ░ ░▒ ░      ░  ░ \n", #6
    "     ░░░ ░ ░ ░░           ░ \n", #7
    "       ░               ░    \n", #8
]
TWICE_BLOODY = [
    "▄▄▄█████▓ █     █░ ██▓ ▄████▄  ▓█████ \n", #0
    "▓  ██▒ ▓▒▓█░ █ ░█░▓██▒▒██▀ ▀█  ▓█   ▀ \n", #1
    "▒ ▓██░ ▒░▒█░ █ ░█ ▒██▒▒▓█    ▄ ▒███   \n", #2
    "░ ▓██▓ ░ ░█░ █ ░█ ░██░▒▓▓▄ ▄██▒▒▓█  ▄ \n", #3
    "  ▒██▒ ░ ░░██▒██▓ ░██░▒ ▓███▀ ░░▒████▒\n", #4
    "  ▒ ░░   ░ ▓░▒ ▒  ░▓  ░ ░▒ ▒  ░░░ ▒░ ░\n", #5
    "  ▒ ░░   ░ ▓░▒ ▒  ░▓  ░ ░▒ ▒  ░░░ ▒░ ░\n", #6
    "    ░      ▒ ░ ░   ▒ ░  ░  ▒    ░ ░  ░\n", #7
    "  ░        ░   ░   ▒ ░░           ░   \n", #8
    "             ░     ░  ░ ░         ░  ░\n", #9
    "                      ░               \n", #10
]
TONIGHT_BLOODY = [
    "▄▄▄█████▓ ▒█████   ███▄    █  ██▓  ▄████  ██░ ██ ▄▄▄█████▓\n", #0
    "▓  ██▒ ▓▒▒██▒  ██▒ ██ ▀█   █ ▓██▒ ██▒ ▀█▒▓██░ ██▒▓  ██▒ ▓▒\n", #1
    "▒ ▓██░ ▒░▒██░  ██▒▓██  ▀█ ██▒▒██▒▒██░▄▄▄░▒██▀▀██░▒ ▓██░ ▒░\n", #2
    "░ ▓██▓ ░ ▒██   ██░▓██▒  ▐▌██▒░██░░▓█  ██▓░▓█ ░██ ░ ▓██▓ ░ \n", #3
    "  ▒██▒ ░ ░ ████▓▒░▒██░   ▓██░░██░░▒▓███▀▒░▓█▒░██▓  ▒██▒ ░ \n", #4
    "  ▒ ░░   ░ ▒░▒░▒░ ░ ▒░   ▒ ▒ ░▓   ░▒   ▒  ▒ ░░▒░▒  ▒ ░░   \n", #5
    "    ░      ░ ▒ ▒░ ░ ░░   ░ ▒░ ▒ ░  ░   ░  ▒ ░▒░ ░    ░    \n", #6
    "  ░      ░ ░ ░ ▒     ░   ░ ░  ▒ ░░ ░   ░  ░  ░░ ░  ░      \n", #7
    "             ░ ░           ░  ░        ░  ░  ░  ░         \n", #8
]
SO_THEEDGE = [
    "   ▄▄▄▄▄   ████▄\n", #0
    "  █     ▀▄ █   █\n", #1
    "▄  ▀▀▀▀▄   █   █\n", #2
    " ▀▄▄▄▄▀    ▀████\n", #3
    "                \n", #4
    "                \n", #5
    "                \n", #6
]
PLEASE_THEEDGE = [
    "█ ▄▄  █     ▄███▄   ██      ▄▄▄▄▄   ▄███▄  \n", #0
    "█   █ █     █▀   ▀  █ █    █     ▀▄ █▀   ▀ \n", #1
    "█▀▀▀  █     ██▄▄    █▄▄█ ▄  ▀▀▀▀▄   ██▄▄   \n", #2
    "█     ███▄  █▄   ▄▀ █  █  ▀▄▄▄▄▀    █▄   ▄▀\n", #3
    " █        ▀ ▀███▀      █            ▀███▀  \n", #4
    "  ▀                   █                    \n", #5
    "                     ▀                     \n", #6
]
JUST_THEEDGE = [
    "  ▄▄▄▄▄ ▄      ▄▄▄▄▄      ▄▄▄▄▀\n", #0
    "▄▀  █    █    █     ▀▄ ▀▀▀ █   \n", #1
    "    █ █   █ ▄  ▀▀▀▀▄       █   \n", #2
    " ▄ █  █   █  ▀▄▄▄▄▀       █    \n", #3
    "  ▀   █▄ ▄█              ▀     \n", #4
    "       ▀▀▀                     \n", #5
    "                               \n", #6
]
HOLD_THEEDGE = [
    " ▄  █ ████▄ █     ██▄  \n", #0
    "█   █ █   █ █     █  █ \n", #1
    "██▀▀█ █   █ █     █   █\n", #2
    "█   █ ▀████ ███▄  █  █ \n", #3
    "   █            ▀ ███▀ \n", #4
    "  ▀                    \n", #5
    "                       \n", #6
]
ME_THEEDGE = [
    "█▀▄▀█ ▄███▄  \n", #0
    "█ █ █ █▀   ▀ \n", #1
    "█ ▄ █ ██▄▄   \n", #2
    "█   █ █▄   ▄▀\n", #3
    "   █  ▀███▀  \n", #4
    "  ▀          \n", #5
    "             \n", #6
]
ONE_THEEDGE = [
    "████▄    ▄   ▄███▄  \n", #0
    "█   █     █  █▀   ▀ \n", #1
    "█   █ ██   █ ██▄▄   \n", #2
    "▀████ █ █  █ █▄   ▄▀\n", #3
    "      █  █ █ ▀███▀  \n", #4
    "      █   ██        \n", #5
    "                    \n", #6
]
LAST_THEEDGE = [
    "█    ██      ▄▄▄▄▄      ▄▄▄▄▀ \n", #0
    "█    █ █    █     ▀▄ ▀▀▀ █    \n", #1
    "█    █▄▄█ ▄  ▀▀▀▀▄       █    \n", #2
    "███▄ █  █  ▀▄▄▄▄▀       █     \n", #3
    "    ▀   █              ▀      \n", #4
    "       █                      \n", #5
    "      ▀                       \n", #6
]
TIME_BLOODY = [
    "▄▄▄█████▓ ██▓ ███▄ ▄███▓▓█████ \n", #0
    "▓  ██▒ ▓▒▓██▒▓██▒▀█▀ ██▒▓█   ▀ \n", #1
    "▒ ▓██░ ▒░▒██▒▓██    ▓██░▒███   \n", #2
    "░ ▓██▓ ░ ░██░▒██    ▒██ ▒▓█  ▄ \n", #3
    "  ▒██▒ ░ ░██░▒██▒   ░██▒░▒████▒\n", #4
    "  ▒ ░░   ░▓  ░ ▒░   ░  ░░░ ▒░ ░\n", #5
    "    ░     ▒ ░░  ░      ░ ░ ░  ░\n", #6
    "  ░       ▒ ░░      ░      ░   \n", #7
    "          ░         ░      ░  ░\n", #8
]
GOODBYE_BLOODY = [
    "  ▄████  ▒█████   ▒█████  ▓█████▄  ▄▄▄▄ ▓██   ██▓▓█████ \n", #0
    " ██▒ ▀█▒▒██▒  ██▒▒██▒  ██▒▒██▀ ██▌▓█████▄▒██  ██▒▓█   ▀ \n", #1
    "▒██░▄▄▄░▒██░  ██▒▒██░  ██▒░██   █▌▒██▒ ▄██▒██ ██░▒███   \n", #2
    "░▓█  ██▓▒██   ██░▒██   ██░░▓█▄   ▌▒██░█▀  ░ ▐██▓░▒▓█  ▄ \n", #3
    "░▒▓███▀▒░ ████▓▒░░ ████▓▒░░▒████▓ ░▓█  ▀█▓░ ██▒▓░░▒████▒\n", #4
    " ░▒   ▒ ░ ▒░▒░▒░ ░ ▒░▒░▒░  ▒▒▓  ▒ ░▒▓███▀▒ ██▒▒▒ ░░ ▒░ ░\n", #5
    "  ░   ░   ░ ▒ ▒░   ░ ▒ ▒░  ░ ▒  ▒ ▒░▒   ░▓██ ░▒░  ░ ░  ░\n", #6
    "░ ░   ░ ░ ░ ░ ▒  ░ ░ ░ ▒   ░ ░  ░  ░    ░▒ ▒ ░░     ░   \n", #7
    "      ░     ░ ░      ░ ░     ░     ░     ░ ░        ░  ░\n", #8
    "                           ░            ░░ ░            \n", #9
]
AAH_BLOODY = [
    " ▄▄▄      ▄▄▄       ██░ ██  ▐██▌ \n", #0
    "▒████▄   ▒████▄    ▓██░ ██▒ ▐██▌ \n", #1
    "▒██  ▀█▄ ▒██  ▀█▄  ▒██▀▀██░ ▐██▌ \n", #2
    "░██▄▄▄▄██░██▄▄▄▄██ ░▓█ ░██  ▓██▒ \n", #3
    " ▓█   ▓██▒▓█   ▓██▒░▓█▒░██▓ ▒▄▄  \n", #4
    " ▒▒   ▓▒█░▒▒   ▓▒█░ ▒ ░░▒░▒ ░▀▀▒ \n", #5
    "  ░   ▒    ░   ▒    ░  ░░ ░    ░ \n", #6
    "      ░  ░     ░  ░ ░  ░  ░ ░    \n", #7
]

































I_BIG = [
    "     _____      \n", #0
    "    |_   _|     \n", #1
    "      | |______ \n", #2
    "      | |______|\n", #3
    "     _| |_      \n", #4
    "    |_____|     \n", #5
]
DONT_BIG = [
    "     _____   ____  _   _ _______     \n", #0
    "    |  __ \\ / __ \\| \\ | |__   __|    \n", #1
    "    | |  | | |  | |  \\| |  | |______ \n", #2
    "    | |  | | |  | | . ` |  | |______|\n", #3
    "    | |__| | |__| | |\\  |  | |       \n", #4
    "    |_____/ \\____/|_| \\_|  |_|       \n", #5
]
HAVE_BIG = [
    "     _    _     __      ________      \n", #0
    "    | |  | |   /\\ \\    / /  ____|     \n", #1
    "    | |__| |  /  \\ \\  / /| |__ ______ \n", #2
    "    |  __  | / /\\ \\ \\/ / |  __|______|\n", #3
    "    | |  | |/ ____ \\  /  | |____      \n", #4
    "    |_|  |_/_/    \\_\\/   |______|     \n", #5
]
A_BIG = [
    "                   \n", #0
    "        /\\         \n", #1
    "       /  \\ ______ \n", #2
    "      / /\\ \\______|\n", #3
    "     / ____ \\      \n", #4
    "    /_/    \\_\\     \n", #5
]





I_SBLOOD = [
    "    @@@         \n", #0
    "    @@!         \n", #1
    "    !!@ @!@!@!@!\n", #2
    "    !!:         \n", #3
    "    :           \n", #4
]
DONT_SBLOOD = [
    "    @@@@@@@   @@@@@@  @@@  @@@ @@@@@@@         \n", #0
    "    @@!  @@@ @@!  @@@ @@!@!@@@   @@!           \n", #1
    "    @!@  !@! @!@  !@! @!@@!!@!   @!!   @!@!@!@!\n", #2
    "    !!:  !!! !!:  !!! !!:  !!!   !!:           \n", #3
    "    :: :  :   : :. :  ::    :     :            \n", #4
]
HAVE_SBLOOD = [
    "    @@@  @@@  @@@@@@  @@@  @@@ @@@@@@@@         \n", #0
    "    @@!  @@@ @@!  @@@ @@!  @@@ @@!              \n", #1
    "    @!@!@!@! @!@!@!@! @!@  !@! @!!!:!   @!@!@!@!\n", #2
    "    !!:  !!! !!:  !!!  !: .:!  !!:              \n", #3
    "     :   : :  :   : :    ::    : :: :::         \n", #4
]
A_SBLOOD = [
    "     @@@@@@          \n", #0
    "    @@!  @@@         \n", #1
    "    @!@!@!@! @!@!@!@!\n", #2
    "    !!:  !!!         \n", #3
    "     :   : :         \n", #4
]





I_ANSIREGULAR = [
    "    ██       \n", #0
    "    ██       \n", #1
    "    ██ █████ \n", #2
    "    ██       \n", #3
    "    ██       \n", #4
]
DONT_ANSIREGULAR = [
    "    ██████   ██████  ███    ██ ████████       \n", #0
    "    ██   ██ ██    ██ ████   ██    ██          \n", #1
    "    ██   ██ ██    ██ ██ ██  ██    ██    █████ \n", #2
    "    ██   ██ ██    ██ ██  ██ ██    ██          \n", #3
    "    ██████   ██████  ██   ████    ██          \n", #4
]
HAVE_ANSIREGULAR = [
    "    ██   ██  █████  ██    ██ ███████       \n", #0
    "    ██   ██ ██   ██ ██    ██ ██            \n", #1
    "    ███████ ███████ ██    ██ █████   █████ \n", #2
    "    ██   ██ ██   ██  ██  ██  ██            \n", #3
    "    ██   ██ ██   ██   ████   ███████       \n", #4
]
A_ANSIREGULAR = [
    "     █████        \n", #0
    "    ██   ██       \n", #1
    "    ███████ █████ \n", #2
    "    ██   ██       \n", #3
    "    ██   ██       \n", #4
]





I_THEEDGE = [
    "    ▄█ \n", #0
    "    ██ \n", #1
    "    ██ \n", #2
    "    ▐█ \n", #3
    "     ▐ \n", #4
    "\n",        #5
    "\n",        #6
]
DONT_THEEDGE = [
    "    ██▄   ████▄    ▄     ▄▄▄▄▀ \n", #0
    "    █  █  █   █     █ ▀▀▀ █    \n", #1
    "    █   █ █   █ ██   █    █    \n", #2
    "    █  █  ▀████ █ █  █   █     \n", #3
    "    ███▀        █  █ █  ▀      \n", #4
    "                █   ██         \n", #5
    "\n",                                #6
]
HAVE_THEEDGE = [
    "     ▄  █ ██       ▄   ▄███▄   \n", #0
    "    █   █ █ █       █  █▀   ▀  \n", #1
    "    ██▀▀█ █▄▄█ █     █ ██▄▄    \n", #2
    "    █   █ █  █  █    █ █▄   ▄▀ \n", #3
    "       █     █   █  █  ▀███▀   \n", #4
    "      ▀     █     █▐           \n", #5
    "           ▀      ▐            \n", #6
]
A_THEEDGE = [
    "    ██   \n", #0
    "    █ █  \n", #1
    "    █▄▄█ \n", #2
    "    █  █ \n", #3
    "       █ \n", #4
    "      █  \n", #5
    "     ▀   \n", #6
]





I_AMCSlash = [
    "    s.  \n", #0
    "    SS. \n", #1
    "    S%S \n", #2
    "    S%S \n", #3
    "    S%S \n", #4
    "    S%S \n", #5
    "    `:; \n", #6
    "    ;,. \n", #7
    "    ;:' \n", #8
]
DONT_AMCSlash = [
    "    .s5SSSs.  .s5SSSs.  .s    s.  .s5SSSSs. \n", #0
    "          SS.       SS.       SS.    SSS    \n", #1
    "    sS    S%S sS    S%S sSs.  S%S    S%S    \n", #2
    "    SS    S%S SS    S%S SS`S. S%S    S%S    \n", #3
    "    SS    S%S SS    S%S SS `S.S%S    S%S    \n", #4
    "    SS    S%S SS    S%S SS  `sS%S    S%S    \n", #5
    "    SS    `:; SS    `:; SS    `:;    `:;    \n", #6
    "    SS    ;,. SS    ;,. SS    ;,.    ;,.    \n", #7
    "    ;;;;;;;:' `:;;;;;:' :;    ;:'    ;:'    \n", #8
]
HAVE_AMCSlash = [
    "    .s    s.  .s5SSSs.  .s    s.  .s5SSSs.  \n", #0
    "          SS.       SS.       SS.       SS. \n", #1
    "    sS    S%S sS    S%S sS    S%S sS    `:; \n", #2
    "    SS    S%S SS    S%S SS    S%S SS        \n", #3
    "    SSSs. S%S SSSs. S%S SS    S%S SSSs.     \n", #4
    "    SS    S%S SS    S%S  SS   S%S SS        \n", #5
    "    SS    `:; SS    `:;  SS   `:; SS        \n", #6
    "    SS    ;,. SS    ;,.   SS  ;,. SS    ;,. \n", #7
    "    :;    ;:' :;    ;:'    `:;;:' `:;;;;;:' \n", #8
]
A_AMCSlash = [
    "    .s5SSSs.  \n", #0
    "          SS. \n", #1
    "    sS    S%S \n", #2
    "    SS    S%S \n", #3
    "    SSSs. S%S \n", #4
    "    SS    S%S \n", #5
    "    SS    `:; \n", #6
    "    SS    ;,. \n", #7
    "    :;    ;:' \n", #8
]





I_DeltaCorpsPriest1 = [
    "     ▄█  \n", #0
    "    ███  \n", #1
    "    ███▌ \n", #2
    "    ███▌ \n", #3
    "    ███▌ \n", #4
    "    ███  \n", #5
    "    ███  \n", #6
    "    █▀   \n", #7
]
DONT_DeltaCorpsPriest1 = [
    "    ████████▄   ▄██████▄  ███▄▄▄▄       ███     \n", #0
    "    ███   ▀███ ███    ███ ███▀▀▀██▄ ▀█████████▄ \n", #1
    "    ███    ███ ███    ███ ███   ███    ▀███▀▀██ \n", #2
    "    ███    ███ ███    ███ ███   ███     ███   ▀ \n", #3
    "    ███    ███ ███    ███ ███   ███     ███     \n", #4
    "    ███    ███ ███    ███ ███   ███     ███     \n", #5
    "    ███   ▄███ ███    ███ ███   ███     ███     \n", #6
    "    ████████▀   ▀██████▀   ▀█   █▀     ▄████▀   \n", #7
]
HAVE_DeltaCorpsPriest1 = [
    "       ▄█    █▄       ▄████████  ▄█    █▄     ▄████████ \n", #0
    "      ███    ███     ███    ███ ███    ███   ███    ███ \n", #1
    "      ███    ███     ███    ███ ███    ███   ███    █▀  \n", #2
    "     ▄███▄▄▄▄███▄▄   ███    ███ ███    ███  ▄███▄▄▄     \n", #3
    "    ▀▀███▀▀▀▀███▀  ▀███████████ ███    ███ ▀▀███▀▀▀     \n", #4
    "      ███    ███     ███    ███ ███    ███   ███    █▄  \n", #5
    "      ███    ███     ███    ███ ███    ███   ███    ███ \n", #6
    "      ███    █▀      ███    █▀   ▀██████▀    ██████████ \n", #7
]
A_DeltaCorpsPriest1 = [
    "       ▄████████ \n", #0
    "      ███    ███ \n", #1
    "      ███    ███ \n", #2
    "      ███    ███ \n", #3
    "    ▀███████████ \n", #4
    "      ███    ███ \n", #5
    "      ███    ███ \n", #6
    "      ███    █▀  \n", #7
]





I_BlurVisionASCII = [
    "    ░▒▓█▓▒░ \n", #0
    "    ░▒▓█▓▒░ \n", #1
    "    ░▒▓█▓▒░ \n", #2
    "    ░▒▓█▓▒░ \n", #3
    "    ░▒▓█▓▒░ \n", #4
    "    ░▒▓█▓▒░ \n", #5
    "    ░▒▓█▓▒░ \n", #6
]
DONT_BlurVisionASCII = [
    "    ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓███████▓▒░▒▓████████▓▒░ \n", #0
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #1
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #2
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #3
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #4
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #5
    "    ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #6
]
HAVE_BlurVisionASCII = [
    "    ░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░ \n", #0
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #1
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓█▓▒░        \n", #2
    "    ░▒▓████████▓▒░▒▓████████▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓██████▓▒░   \n", #3
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░        \n", #4
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░        \n", #5
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓██▓▒░  ░▒▓████████▓▒░ \n", #6
]
A_BlurVisionASCII = [
    "     ░▒▓██████▓▒░  \n", #0
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #1
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #2
    "    ░▒▓████████▓▒░ \n", #3
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #4
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #5
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #6
]





I_THIS = [
    "     ▄▀▀█▀▄   \n", #0
    "    █   █  █  \n", #1
    "    ▐   █  ▐  \n", #2
    "        █     \n", #3
    "     ▄▀▀▀▀▀▄  \n", #4
    "    █       █ \n", #5
    "    ▐       ▐ \n", #6
]
DONT_THIS = [
    "     ▄▀▀█▄▄   ▄▀▀▀▀▄   ▄▀▀▄ ▀▄  ▄▀▀▀█▀▀▄ \n", #0
    "    █ ▄▀   █ █      █ █  █ █ █ █    █  ▐ \n", #1
    "    ▐ █    █ █      █ ▐  █  ▀█ ▐   █     \n", #2
    "      █    █ ▀▄    ▄▀   █   █     █      \n", #3
    "     ▄▀▄▄▄▄▀   ▀▀▀▀   ▄▀   █    ▄▀       \n", #4
    "    █     ▐           █    ▐   █         \n", #5
    "    ▐                 ▐        ▐         \n", #6
]
HAVE_THIS = [
    "     ▄▀▀▄ ▄▄   ▄▀▀█▄   ▄▀▀▄ ▄▀▀▄  ▄▀▀█▄▄▄▄ \n", #0
    "    █  █   ▄▀ ▐ ▄▀ ▀▄ █   █    █ ▐  ▄▀   ▐ \n", #1
    "    ▐  █▄▄▄█    █▄▄▄█ ▐  █    █    █▄▄▄▄▄  \n", #2
    "       █   █   ▄▀   █    █   ▄▀    █    ▌  \n", #3
    "      ▄▀  ▄▀  █   ▄▀      ▀▄▀     ▄▀▄▄▄▄   \n", #4
    "     █   █    ▐   ▐               █    ▐   \n", #5
    "     ▐   ▐                        ▐        \n", #6
]
A_THIS = [
    "     ▄▀▀█▄  \n", #0
    "    ▐ ▄▀ ▀▄ \n", #1
    "      █▄▄▄█ \n", #2
    "     ▄▀   █ \n", #3
    "    █   ▄▀  \n", #4
    "    ▐   ▐   \n", #5
    "            \n", #6
]

        















































dogmaticalyric_nums = {
    0: ' ',

    3: 'FINAL.\n',
    12: 'FINAL.\nFINAL.',
    
    22: 'WE\n',
    23: 'WE HAVE,\n',
    28: 'WE HAVE, 12\n',
    30: 'WE HAVE, 12 HOURS\n',
    32: 'WE HAVE, 12 HOURS LEFT.\n',
    
    40: 'WE HAVE, 12 HOURS LEFT.\nWE',
    41: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE,',
    46: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE, 12',
    48: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE, 12 HOURS',
    50: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE, 12 HOURS LEFT.',
    
    61: 'FINAL.\n',
    70: 'FINAL.\nFINAL.',
    
    80: 'WE\n',
    81: 'WE HAVE,\n',
    86: 'WE HAVE, 12\n',
    88: 'WE HAVE, 12 HOURS\n',
    90: 'WE HAVE, 12 HOURS LEFT.\n',
    
    98: 'WE HAVE, 12 HOURS LEFT.\nWE',
    99: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE,',
    104: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE, 12',
    106: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE, 12 HOURS',
    108: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE, 12 HOURS LEFT.',
    
    116: 'Hey!\n',
    120: 'Hey!\nHey!',
    
    125: 'Hey!\n',
    129: 'Hey!\nHEY!',

    133: 'HEY!\n',
    137: 'HEY!\nHEY!',

    141: 'HEY!\n',
    145: 'HEY!\nHEY!',


    150: 'HE-\n',
    151: 'HE-HE-\n',
    152: 'HE-HE-EY!\n',

    154: 'HE-HE-EY!\nHE-',
    155: 'HE-HE-EY!\nHE-HE',
    156: 'HE-HE-EY!\nHE-HE-EY!',

    158: 'HE-\n',
    159: 'HE-HE-\n',
    160: 'HE-HE-EY!\n',

    162: 'HE-HE-EY!\nHE-',
    163: 'HE-HE-EY!\nHE-HE',
    164: 'HE-HE-EY!\nHE-HE-EY!',

    166: 'HE-\n',
    167: 'HE-HE-\n',
    168: 'HE-HE-EY!\n',

    170: 'HE-HE-EY!\nHE-',
    171: 'HE-HE-EY!\nHE-HE',
    172: 'HE-HE-EY!\nHE-HE-EY!',

    174: 'HE-\n',
    175: 'HE-HE-\n',
    176: 'HE-HE-EY!\n',

    178: 'HE-HE-EY!\nHE-',
    179: 'HE-HE-EY!\nHE-HE',
    180: 'HE-HE-EY!\nHE-HE-EY!',

    183: 'HE-\n',
    184: 'HE-HE-\n',
    185: 'HE-HE-EY!\n',

    187: 'HE-HE-EY!\nHE-',
    188: 'HE-HE-EY!\nHE-HE',
    189: 'HE-HE-EY!\nHE-HE-EY!',

    192: 'HE-\n',
    193: 'HE-HE-\n',
    194: 'HE-HE-EY!\n',

    196: 'HE-HE-EY!\nHE-',
    197: 'HE-HE-EY!\nHE-HE',
    198: 'HE-HE-EY!\nHE-HE-EY!',

    200: "CORPSE\n",
    201: "CORPSE LOCKED\n",
    202: "CORPSE LOCKED IN\n",
    203: "CORPSE LOCKED IN MY\n",
    204: "CORPSE LOCKED IN MY BATH-\n",
    205: "CORPSE LOCKED IN MY BATHROOM",

    207: "CORPSE LOCKED IN MY BATHROOM\nBLOOD",
    208: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS",
    209: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS IN-",
    210: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS INSIDE",
    211: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS INSIDE MY",
    212: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS INSIDE MY SINK",

    214: "I\n",
    215: "I WAN-\n",
    216: "I WANNA\n",
    217: BE_AMCSLASH[0]+BE_AMCSLASH[1]+BE_AMCSLASH[2]+BE_AMCSLASH[3]+BE_AMCSLASH[4]+BE_AMCSLASH[5]+BE_AMCSLASH[6]+BE_AMCSLASH[7]+BE_AMCSLASH[8]+BE_AMCSLASH[9]+BE_AMCSLASH[10]+BE_AMCSLASH[11]+BE_AMCSLASH[12]+BE_AMCSLASH[13]+BE_AMCSLASH[14],
    218: BE_AMCAAA01[0]+BE_AMCAAA01[1]+BE_AMCAAA01[2]+BE_AMCAAA01[3]+BE_AMCAAA01[4]+BE_AMCAAA01[5]+BE_AMCAAA01[6]+BE_AMCAAA01[7]+BE_AMCAAA01[8]+BE_AMCAAA01[9]+BE_AMCAAA01[10]+BE_AMCAAA01[11]+BE_AMCAAA01[12]+BE_AMCAAA01[13]+BE_AMCAAA01[14],
    219: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CA-\n",
    220: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATA-\n",
    221: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATO-\n",
    222: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\n",
    223: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE",
    224: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-",
    225: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I",
    226: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT",
    227: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT E-",
    228: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT EVEN",
    229: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT EVEN THINK",

    230: "BLEE-\n",

    231: "BLEE-BLEED-\n",
    232: "BLEE-BLEEDING\n",
    233: "BLEE-BLEEDING OUT\n",
    234: "BLEE-BLEEDING OUT IN-\n",
    235: "BLEE-BLEEDING OUT INSIDE\n",
    236: "BLEE-BLEEDING OUT INSIDE MY\n",
    237: "BLEE-BLEEDING OUT INSIDE MY CLO-\n",
    238: "BLEE-BLEEDING OUT INSIDE MY CLOSET\n",
    239: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE",
    240: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SE-",
    241: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS,",
    243: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS, THAT",
    244: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS, THAT I",
    245: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS, THAT I WILL",
    246: KEEP_AMCAAA01[0]+KEEP_AMCAAA01[1]+KEEP_AMCAAA01[2]+KEEP_AMCAAA01[3]+KEEP_AMCAAA01[4]+KEEP_AMCAAA01[5]+KEEP_AMCAAA01[6]+KEEP_AMCAAA01[7]+KEEP_AMCAAA01[8]+KEEP_AMCAAA01[9]+KEEP_AMCAAA01[10]+KEEP_AMCAAA01[11]+KEEP_AMCAAA01[12]+KEEP_AMCAAA01[13],
    247: KEEP_AMCAAA01[0]+KEEP_AMCAAA01[1]+KEEP_AMCAAA01[2]+KEEP_AMCAAA01[3]+KEEP_AMCAAA01[4]+KEEP_AMCAAA01[5]+KEEP_AMCAAA01[6]+KEEP_AMCAAA01[7]+KEEP_AMCAAA01[8]+KEEP_AMCAAA01[9]+KEEP_AMCAAA01[10]+KEEP_AMCAAA01[11]+KEEP_AMCAAA01[12]+KEEP_AMCAAA01[13],
    
    248: " WORTH-\n",
    249: "  WORTHLESS\n",
    250: "   WORTHLESS FUCK-\n",
    251: "    WORTHLESS FUCKING\n",
    252: "     WORTHLESS FUCKING CUM\n",
    253: "      WORTHLESS FUCKING CUM DE-\n",
    254: "       WORTHLESS FUCKING CUM DEPO-\n",
    255: "        WORTHLESS FUCKING CUM DEPOSIT\n",
    256: "         WORTHLESS FUCKING CUM DEPOSIT\n         I-",
    257: "          WORTHLESS FUCKING CUM DEPOSIT\n          I-I",
    258: "           WORTHLESS FUCKING CUM DEPOSIT\n           I-I DON'T",
    259: "             WORTHLESS FUCKING CUM DEPOSIT\n            I-I DON'T E-",
    260: "             WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER",
    261: "             WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",

    262: "ME-          WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",
    263: "ME-ME-       WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",
    264: "ME-ME-ME-    WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",

    265: "ME-ME-ME-   MEN-\n",
    266: "ME-ME-ME-  MENTAL\n",
    267: "ME-ME-ME  MENTAL SHARDS\n",
    268: "ME-ME-M  MENTAL SHARDS IN-\n",
    269: "ME-ME-  MENTAL SHARDS INSIDE\n",
    270: "ME-ME  MENTAL SHARDS INSIDE MY\n",
    271: "ME-M  MENTAL SHARDS INSIDE MY VO-\n",
    272: "ME-  MENTAL SHARDS INSIDE MY VOMIT\n",
    273: "ME  MENTAL SHARDS INSIDE MY VOMIT\n    GUN",

    274: "M  MENTAL SHARDS INSIDE MY VOMIT\n   GUN",

    275: "  MENTAL SHARDS INSIDE MY VOMIT\n  GUN SHOTS",
    276: " MENTAL SHARDS INSIDE MY VOMIT\n GUN SHOTS THROUGH",
    277: "MENTAL SHARDS INSIDE MY VOMIT\n GUN SHOTS THROUGH THE",
    278: "MENTAL SHARDS INSIDE MY VOMIT\nGUN SHOTS THROUGH THE DOOR",

    281: "I",
    282: "I CAN",
    283: "I CAN TAKE",
    284: "I CAN TAKE JUST",
    285: "I CAN TAKE JUST WHAT",
    286: "I CAN TAKE JUST WHAT I",
    287: "I CAN TAKE JUST WHAT I WAN-",
    288: "I CAN TAKE JUST WHAT I WANTED",

    289: "WHEN",
    290: "WHEN I-",
    291: "WHEN I-I",
    292: "WHEN I-I SET-",
    293: "WHEN I-I SETTLE",
    294: "WHEN I-I SETTLE THE",
    295: "WHEN I-I SETTLE THE SCORE",

    296: "CU-\n",
    297: "CU-CUT\n",
    298: "CU-CUT MY-\n",
    299: "CU-CUT MYSELF\n",
    300: "CU-CUT MYSELF UP\n",
    301: "CU-CUT MYSELF UP IN\n", 
    302: "CU-CUT MYSELF UP IN A\n",
    303: "CU-CUT MYSELF UP IN A RIB-\n",
    304: "CU-CUT MYSELF UP IN A RIBBONS\n",

    306: "CU-CUT MYSELF UP IN A RIBBONS\nALL-",
    307: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL",
    308: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL O-",
    309: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL OVER",
    310: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL OVER THE",
    311: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL OVER THE FLOOR",

    313: "I",
    314: "I GOT",
    315: "I GOT BITE",
    316: "I GOT BITE MARKS",
    317: "I GOT BITE MARKS ON",
    318: "I GOT BITE MARKS ON MY",
    319: "I GOT BITE MARKS ON MY STO-",
    320: "I GOT BITE MARKS ON MY STOMACH\n",
    321: "I GOT BITE MARKS ON MY STOMACH\nTHAT",
    322: "I GOT BITE MARKS ON MY STOMACH\nTHAT WERE-",
    323: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T",

    326: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE",
    327: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BE-",
    328: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],
    329: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],
    330: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],
    331: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],


    332: "BLOOD",

    334: "BLOOD BE-",
    335: "BLOOD BEHIND", 
    336: "BLOOD BEHIND MY",

    338: "BLOOD BEHIND MY EYES",
    339: "BLOOD BEHIND MY EYES WHEN",

    341: "BLOOD BEHIND MY EYES WHEN\nI",
    342: "BLOOD BEHIND MY EYES WHEN\nI TRY",
    343: "BLOOD BEHIND MY EYES WHEN\nI TRY TO", 
    344: "BLOOD BEHIND MY EYES WHEN\nI TRY TO SLEEP",
    345: "BLOOD BEHIND MY EYES WHEN\nI TRY TO SLEEP AT",
    346: "BLOOD BEHIND MY EYES WHEN\nI TRY TO SLEEP AT NIGHT",


    349: "GO-",

    352: "GOING",

    354: "GOING MISS-",
    355: "GOING MISSING", 
    356: "GOING MISSING WHEN\n",
    357: "GOING MISSING WHEN\nMY",

    359: "GOING MISSING WHEN\nMY MIND",

    361: "GOING MISSING WHEN\nMY MIND TURNS", 
    362: "GOING MISSING WHEN\nMY MIND TURNS OUT",
    363: "GOING MISSING WHEN\nMY MIND TURNS OUT THE",
    364: "GOING MISSING WHEN\nMY MIND TURNS OUT THE LIGHTS",

    367: I_BIG[0]+I_BIG[1]+I_BIG[2]+I_BIG[3]+I_BIG[4]+I_BIG[5], 
    368: DONT_BIG[0]+DONT_BIG[1]+DONT_BIG[2]+DONT_BIG[3]+DONT_BIG[4]+DONT_BIG[5],
    369: HAVE_BIG[0]+HAVE_BIG[1]+HAVE_BIG[2]+HAVE_BIG[3]+HAVE_BIG[4]+HAVE_BIG[5],
    370: A_BIG[0]+A_BIG[1]+A_BIG[2]+A_BIG[3]+A_BIG[4]+A_BIG[5],
    371: I_SBLOOD[0]+I_SBLOOD[1]+I_SBLOOD[2]+I_SBLOOD[3]+I_SBLOOD[4], 
    372: DONT_SBLOOD[0]+DONT_SBLOOD[1]+DONT_SBLOOD[2]+DONT_SBLOOD[3]+DONT_SBLOOD[4], 
    373: HAVE_SBLOOD[0]+HAVE_SBLOOD[1]+HAVE_SBLOOD[2]+HAVE_SBLOOD[3]+HAVE_SBLOOD[4],
    374: A_SBLOOD[0]+A_SBLOOD[1]+A_SBLOOD[2]+A_SBLOOD[3]+A_SBLOOD[4],
    375: I_ANSIREGULAR[0]+I_ANSIREGULAR[1]+I_ANSIREGULAR[2]+I_ANSIREGULAR[3]+I_ANSIREGULAR[4],
    376: DONT_ANSIREGULAR[0]+DONT_ANSIREGULAR[1]+DONT_ANSIREGULAR[2]+DONT_ANSIREGULAR[3]+DONT_ANSIREGULAR[4],
    377: HAVE_ANSIREGULAR[0]+HAVE_ANSIREGULAR[1]+HAVE_ANSIREGULAR[2]+HAVE_ANSIREGULAR[3]+HAVE_ANSIREGULAR[4],
    378: A_ANSIREGULAR[0]+A_ANSIREGULAR[1]+A_ANSIREGULAR[2]+A_ANSIREGULAR[3]+A_ANSIREGULAR[4],
    379: I_THEEDGE[0]+I_THEEDGE[1]+I_THEEDGE[2]+I_THEEDGE[3]+I_THEEDGE[4]+I_THEEDGE[5]+I_THEEDGE[6],  
    380: DONT_THEEDGE[0]+DONT_THEEDGE[1]+DONT_THEEDGE[2]+DONT_THEEDGE[3]+DONT_THEEDGE[4]+DONT_THEEDGE[5]+DONT_THEEDGE[6],
    381: HAVE_THEEDGE[0]+HAVE_THEEDGE[1]+HAVE_THEEDGE[2]+HAVE_THEEDGE[3]+HAVE_THEEDGE[4]+HAVE_THEEDGE[5]+HAVE_THEEDGE[6],
    382: A_THEEDGE[0]+A_THEEDGE[1]+A_THEEDGE[2]+A_THEEDGE[3]+A_THEEDGE[4]+A_THEEDGE[5]+A_THEEDGE[6],
    383: I_AMCSlash[0]+I_AMCSlash[1]+I_AMCSlash[2]+I_AMCSlash[3]+I_AMCSlash[4]+I_AMCSlash[5]+I_AMCSlash[6]+I_AMCSlash[7]+I_AMCSlash[8],
    384: DONT_AMCSlash[0]+DONT_AMCSlash[1]+DONT_AMCSlash[2]+DONT_AMCSlash[3]+DONT_AMCSlash[4]+DONT_AMCSlash[5]+DONT_AMCSlash[6]+DONT_AMCSlash[7]+DONT_AMCSlash[8], 
    385: HAVE_AMCSlash[0]+HAVE_AMCSlash[1]+HAVE_AMCSlash[2]+HAVE_AMCSlash[3]+HAVE_AMCSlash[4]+HAVE_AMCSlash[5]+HAVE_AMCSlash[6]+HAVE_AMCSlash[7]+HAVE_AMCSlash[8], 
    386: A_AMCSlash[0]+A_AMCSlash[1]+A_AMCSlash[2]+A_AMCSlash[3]+A_AMCSlash[4]+A_AMCSlash[5]+A_AMCSlash[6]+A_AMCSlash[7]+A_AMCSlash[8], 
    387: I_DeltaCorpsPriest1[0]+I_DeltaCorpsPriest1[1]+I_DeltaCorpsPriest1[2]+I_DeltaCorpsPriest1[3]+I_DeltaCorpsPriest1[4]+I_DeltaCorpsPriest1[5]+I_DeltaCorpsPriest1[6]+I_DeltaCorpsPriest1[7], 
    388: DONT_DeltaCorpsPriest1[0]+DONT_DeltaCorpsPriest1[1]+DONT_DeltaCorpsPriest1[2]+DONT_DeltaCorpsPriest1[3]+DONT_DeltaCorpsPriest1[4]+DONT_DeltaCorpsPriest1[5]+DONT_DeltaCorpsPriest1[6]+DONT_DeltaCorpsPriest1[7], 
    389: HAVE_DeltaCorpsPriest1[0]+HAVE_DeltaCorpsPriest1[1]+HAVE_DeltaCorpsPriest1[2]+HAVE_DeltaCorpsPriest1[3]+HAVE_DeltaCorpsPriest1[4]+HAVE_DeltaCorpsPriest1[5]+HAVE_DeltaCorpsPriest1[6]+HAVE_DeltaCorpsPriest1[7],
    390: A_DeltaCorpsPriest1[0]+A_DeltaCorpsPriest1[1]+A_DeltaCorpsPriest1[2]+A_DeltaCorpsPriest1[3]+A_DeltaCorpsPriest1[4]+A_DeltaCorpsPriest1[5]+A_DeltaCorpsPriest1[6]+A_DeltaCorpsPriest1[7], 
    391: I_BlurVisionASCII[0]+I_BlurVisionASCII[1]+I_BlurVisionASCII[2]+I_BlurVisionASCII[3]+I_BlurVisionASCII[4]+I_BlurVisionASCII[5]+I_BlurVisionASCII[6], 
    392: DONT_BlurVisionASCII[0]+DONT_BlurVisionASCII[1]+DONT_BlurVisionASCII[2]+DONT_BlurVisionASCII[3]+DONT_BlurVisionASCII[4]+DONT_BlurVisionASCII[5]+DONT_BlurVisionASCII[6], 
    393: HAVE_BlurVisionASCII[0]+HAVE_BlurVisionASCII[1]+HAVE_BlurVisionASCII[2]+HAVE_BlurVisionASCII[3]+HAVE_BlurVisionASCII[4]+HAVE_BlurVisionASCII[5]+HAVE_BlurVisionASCII[6], 
    394: A_BlurVisionASCII[0]+A_BlurVisionASCII[1]+A_BlurVisionASCII[2]+A_BlurVisionASCII[3]+A_BlurVisionASCII[4]+A_BlurVisionASCII[5]+A_BlurVisionASCII[6], 
    395: I_THIS[0]+I_THIS[1]+I_THIS[2]+I_THIS[3]+I_THIS[4]+I_THIS[5]+I_THIS[6], 
    396: DONT_THIS[0]+DONT_THIS[1]+DONT_THIS[2]+DONT_THIS[3]+DONT_THIS[4]+DONT_THIS[5]+DONT_THIS[6], 
    397: HAVE_THIS[0]+HAVE_THIS[1]+HAVE_THIS[2]+HAVE_THIS[3]+HAVE_THIS[4]+HAVE_THIS[5]+HAVE_THIS[6], 
    398: A_THIS[0]+A_THIS[1]+A_THIS[2]+A_THIS[3]+A_THIS[4]+A_THIS[5]+A_THIS[6], 

    402: "OH", 
    403: "OH MY",
    405: "OH MY GOD",

    407: "SHUT",
    409: "SHUT THE",
    410: "SHUT THE FUCK",
    412: "SHUT THE FUCK UP!",


    417: 'budubudum',
    421: 'budubudumx2',
    425: 'budubudumx3',
    429: 'budubudumx4',
    433: 'budu',

    435: 'THINK',
    437: 'THINK TWICE',
    439: 'THINK TWICE\nTHINK',
    441: 'THINK TWICE\nTHINK TWICE',

    443: 'THINK',
    445: 'THINK TWICE',
    447: 'THINK TWICE\nTHINK-',
    450: 'twiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiice'



    }

asd = {

    190: "THINK\n", 
    191: "THINK TWICE\n", 
    192: "THINK TWICE\nTHINK\n", 
    193: "THINK TWICE\nTHINK TWICE\n",
    194: "THINK TWICE\nTHINK TWICE\nTHINK\n",
    195: "THINK TWICE\nTHINK TWICE\nTHINK TWICE\n",
    196: "THINK TWICE\nTHINK TWICE\nTHINK TWICE\nTHINK-",

    197: "I-\n",
    198: "I-I\n",
    199: "I-I WILL\n",
    200: "I-I WILL BE\n",
    201: "I-I WILL BE IN\n",
    202: "I-I WILL BE IN LOVE",
    203: "I-I WILL BE IN LOVE FOR-\n",
    204: "I-I WILL BE IN LOVE FORE-\n",
    205: "I-I WILL BE IN LOVE FOREVER\n",
    206: "I-I WILL BE IN LOVE FOREVER\nCAUSE",
    207: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M",
    208: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GON-",
    209: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA",
    210: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA DIE",
    211: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA DIE TO-",
    212: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA DIE TONIGHT\n",

    213: "BE-\n",
    214: "BEFORE\n",
    215: "BEFORE I\n",
    216: "BEFORE I BLOOM\n",
    217: "BEFORE I BLOOM IN-\n",
    218: "BEFORE I BLOOM INTO\n",
    219: "BEFORE I BLOOM INTO A\n",
    220: "BEFORE I BLOOM INTO A FLO-\n",
    221: "BEFORE I BLOOM INTO A FLOWER\n",
    222: "BEFORE I BLOOM INTO A FLOWER\nFIRST",
    223: "BEFORE I BLOOM INTO A FLOWER\nFIRST I",
    224: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WAN-",
    225: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WANNA",
    226: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WANNA SAY",
    227: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WANNA SAY GOOD-",
    228: GOODBYE_BLOODY[0]+GOODBYE_BLOODY[1]+GOODBYE_BLOODY[2]+GOODBYE_BLOODY[3]+GOODBYE_BLOODY[4]+GOODBYE_BLOODY[5]+GOODBYE_BLOODY[6]+GOODBYE_BLOODY[7]+GOODBYE_BLOODY[8]+GOODBYE_BLOODY[9],

    229: "",
    230: "",







   

    
    #Transformation complete You are now, as you once were. Beautiful. You are Dogmatica
    
#   _____ _    _ _    _ _______ 
#  / ____| |  | | |  | |__   __|
# | (___ | |__| | |  | |  | |   
#  \___ \|  __  | |  | |  | |      Font Name: Big
#  ____) | |  | | |__| |  | |   
# |_____/|_|  |_|\____/   |_|   

# ░▒▓███████▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░ 
#░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
#░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
# ░▒▓██████▓▒░░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░       Font Name: BlurVision ASCII
#       ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
#       ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
#░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░   ░▒▓█▓▒░     

#   SSSSSSSSSSSSSSS HHHHHHHHH     HHHHHHHHHUUUUUUUU     UUUUUUUUTTTTTTTTTTTTTTTTTTTTTTT
# SS:::::::::::::::SH:::::::H     H:::::::HU::::::U     U::::::UT:::::::::::::::::::::T
#S:::::SSSSSS::::::SH:::::::H     H:::::::HU::::::U     U::::::UT:::::::::::::::::::::T
#S:::::S     SSSSSSSHH::::::H     H::::::HHUU:::::U     U:::::UUT:::::TT:::::::TT:::::T
#S:::::S              H:::::H     H:::::H   U:::::U     U:::::U TTTTTT  T:::::T  TTTTTT
#S:::::S              H:::::H     H:::::H   U:::::D     D:::::U         T:::::T        
# S::::SSSS           H::::::HHHHH::::::H   U:::::D     D:::::U         T:::::T        
#  SS::::::SSSSS      H:::::::::::::::::H   U:::::D     D:::::U         T:::::T            Font Name: Doh
#    SSS::::::::SS    H:::::::::::::::::H   U:::::D     D:::::U         T:::::T        
#       SSSSSS::::S   H::::::HHHHH::::::H   U:::::D     D:::::U         T:::::T        
#            S:::::S  H:::::H     H:::::H   U:::::D     D:::::U         T:::::T        
#            S:::::S  H:::::H     H:::::H   U::::::U   U::::::U         T:::::T        
#SSSSSSS     S:::::SHH::::::H     H::::::HH U:::::::UUU:::::::U       TT:::::::TT      
#S::::::SSSSSS:::::SH:::::::H     H:::::::H  UU:::::::::::::UU        T:::::::::T      
#S:::::::::::::::SS H:::::::H     H:::::::H    UU:::::::::UU          T:::::::::T      
# SSSSSSSSSSSSSSS   HHHHHHHHH     HHHHHHHHH      UUUUUUUUU            TTTTTTTTTTT      

#███████ ██   ██ ██    ██ ████████ 
#██      ██   ██ ██    ██    ██    
#███████ ███████ ██    ██    ██      Font Name: ANSI Regular
#     ██ ██   ██ ██    ██    ██    
#███████ ██   ██  ██████     ██    





#  ██████  ██░ ██  █    ██ ▄▄▄█████▓
#▒██    ▒ ▓██░ ██▒ ██  ▓██▒▓  ██▒ ▓▒
#░ ▓██▄   ▒██▀▀██░▓██  ▒██░▒ ▓██░ ▒░   Font Name: Bloody
#  ▒   ██▒░▓█ ░██ ▓▓█  ░██░░ ▓██▓ ░ 
#▒██████▒▒░▓█▒░██▓▒▒█████▓   ▒██▒ ░ 
#▒ ▒▓▒ ▒ ░ ▒ ░░▒░▒░▒▓▒ ▒ ▒   ▒ ░░   
#░ ░▒  ░ ░ ▒ ░▒░ ░░░▒░ ░ ░     ░    
#░  ░  ░   ░  ░░ ░ ░░░ ░ ░   ░      
#      ░   ░  ░  ░   ░              
#                                   





#   ▄████████    ▄█    █▄    ███    █▄      ███     
#  ███    ███   ███    ███   ███    ███ ▀█████████▄ 
#  ███    █▀    ███    ███   ███    ███    ▀███▀▀██ 
#  ███         ▄███▄▄▄▄███▄▄ ███    ███     ███   ▀ 
#▀███████████ ▀▀███▀▀▀▀███▀  ███    ███     ███        Font Name: Delta Corps Priest 1
#         ███   ███    ███   ███    ███     ███     
#   ▄█    ███   ███    ███   ███    ███     ███     
# ▄████████▀    ███    █▀    ████████▀     ▄████▀   

# ▄▀▀▀▀▄  ▄▀▀▄ ▄▄   ▄▀▀▄ ▄▀▀▄  ▄▀▀▀█▀▀▄ 
#█ █   ▐ █  █   ▄▀ █   █    █ █    █  ▐ 
#   ▀▄   ▐  █▄▄▄█  ▐  █    █  ▐   █     
#▀▄   █     █   █    █    █      █          Font Name: THIS
# █▀▀▀     ▄▀  ▄▀     ▀▄▄▄▄▀   ▄▀       
# ▐       █   █               █         
#        ▐   ▐               ▐         

#   ▄▄▄▄▄    ▄  █   ▄     ▄▄▄▄▀ 
#  █     ▀▄ █   █    █ ▀▀▀ █    
#▄  ▀▀▀▀▄   ██▀▀█ █   █    █       Font Name: The Edge
# ▀▄▄▄▄▀    █   █ █   █   █     
#              █  █▄ ▄█  ▀      
#             ▀    ▀▀▀          

#  @@@@@@ @@@  @@@ @@@  @@@ @@@@@@@
# !@@     @@!  @@@ @@!  @@@   @@!  
#  !@@!!  @!@!@!@! @!@  !@!   @!!       Font Name: S Blood
#     !:! !!:  !!! !!:  !!!   !!:  
# ::.: :   :   : :  :.:: :     :   





#   sSSs   .S    S.    .S       S.   sdSS_SSSSSSbs  
#  d%%SP  .SS    SS.  .SS       SS.  YSSS~S%SSSSSP  
# d%S'    S%S    S%S  S%S       S%S       S%S       
# S%|     S%S    S%S  S%S       S%S       S%S       
# S&S     S%S SSSS%S  S&S       S&S       S&S       
# Y&Ss    S&S  SSS&S  S&S       S&S       S&S            Font Name: AMC AAA01
# `S&&S   S&S    S&S  S&S       S&S       S&S       
#   `S*S  S&S    S&S  S&S       S&S       S&S       
#    l*S  S*S    S*S  S*b       d*S       S*S       
#   .S*P  S*S    S*S  S*S.     .S*S       S*S       
# sSS*S   S*S    S*S   SSSbs_sdSSS        S*S       
# YSS'    SSS    S*S    YSSP~YSSY         S*S       
#                SP                       SP        
#                Y                        Y         

#.s5SSSs.  .s    s.  .s    s.  .s5SSSSs. 
#      SS.       SS.       SS.    SSS    
#sS    `:; sS    S%S sS    S%S    S%S    
#SS        SS    S%S SS    S%S    S%S    
#`:;;;;.   SSSs. S%S SS    S%S    S%S       Font Name: AMC Slash
#      ;;. SS    S%S SS    S%S    S%S    
#      `:; SS    `:; SS    `:;    `:;    
#.,;   ;,. SS    ;,. SS    ;,.    ;,.    
#`:;;;;;:' :;    ;:' `:;;;;;:'    ;:'    




  






















}













cinemapart = False


def fourthwallbreak(Startingtime):

    global window
    global pawsurface
    global pawmirrorsurface

    global facebasesurface
    global faceeyesbasesurface
    global faceeyesdetailsurface
    global facemouthclosedsurface
    global facemouthopenedsurface


    global desktopres

    eyedetailstate = False

    shakeface = 0
    shakemouth = 0
    facezoom = 1

    animtime = 0

    faceallsurface_changed = pygame.Surface((256,256),pygame.SRCALPHA)
    faceallsurface_changed.blit(facebasesurface)
    faceallsurface_changed.blit(faceeyesbasesurface)

    facemouthsurface_changed = facemouthclosedsurface

    #код говнище. похуй.
    while animtime < 3.840:
        try:
            animtime = time.perf_counter() - Startingtime

            animtimems = int(animtime*1000)


            if animtimems in range(800,2560): #clearing screen
                window.fill((0,255,0))

            if animtimems in range(1120,2560): #paw 1 appear
                pawshake = 0
                if animtimems-1120 <= 320:
                    pawshake = abs((animtimems-1440) / 320)
                window.blit(pawsurface,(0-(pawsurface.get_width()//2)+((pawsurface.get_width()//16)*((1-(random.random()*2))*pawshake))+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakeface)),
                                        0+((pawsurface.get_height()//16)*((1-(random.random()*2))*pawshake))+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakeface))))
                
            if animtimems in range(1600,2560): #paw 2 appear
                pawshake = 0
                if animtimems-1600 <= 320:
                    pawshake = abs((animtimems-1600) / 320)
                window.blit(pawmirrorsurface,(desktopres[0]-(pawsurface.get_width()//2)+((pawsurface.get_width()//16)*((1-(random.random()*2))*pawshake))+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakeface)),
                                            0+((pawsurface.get_height()//16)*((1-(random.random()*2))*pawshake))+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakeface))))

            if animtimems in range(160,640): #rolling in dogmatica face render
                rollingin = (animtimems-160) / 480 * 10

                wholefacex = (desktopres[0]//2)-(facebasesurface.get_width()//2+110)+((desktopres[0]//2)/rollingin)
                wholefacey = (desktopres[1]//2)-(facebasesurface.get_height()//2)+((facebasesurface.get_height()//8)*(1-(random.random()*2)))
                
                window.blit(faceallsurface_changed,(wholefacex,
                                                    wholefacey))

                if eyedetailstate:
                    window.blit(faceeyesdetailsurface,(wholefacex,
                                                               wholefacey))
                window.blit(facemouthsurface_changed,(wholefacex,
                                                      wholefacey))

                    
            if animtimems in range(640,2560): #staying still dogmatica face render
                
                wholefacex = (desktopres[0]//2)-((facebasesurface.get_width()*facezoom)//2)+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakeface))
                wholefacey = (desktopres[1]//2)-((facebasesurface.get_height()*facezoom)//2)+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakeface))
                
                window.blit(faceallsurface_changed,(wholefacex,
                                                    wholefacey))

                if eyedetailstate:
                    window.blit(faceeyesdetailsurface,(wholefacex,
                                                       wholefacey))

                window.blit(facemouthsurface_changed,(wholefacex+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakemouth)),
                                                      wholefacey+((facemouthopenedsurface.get_height()*facezoom)//16)*((1-(random.random()*2)*shakemouth))))
                

            if animtimems in range(320,480): #OH
                if animtimems >= 420:
                    facemouthsurface_changed = facemouthclosedsurface
                else: 
                    facemouthsurface_changed = facemouthopenedsurface
            if animtimems in range(480,800): #MY
                if animtimems >= 720:
                    facemouthsurface_changed = facemouthclosedsurface
                else: 
                    facemouthsurface_changed = facemouthopenedsurface
            if animtimems in range(800,1120): #GOD
                shakemouth = abs((animtimems-1120) / 320)

                if animtimems >= 1040:
                    facemouthsurface_changed = facemouthclosedsurface
                else: 
                    facemouthsurface_changed = facemouthopenedsurface
            if animtimems in range(1120,1440): #SHUT
                facezoom = 1+((animtimems-1120)/320*2)
                #lets say that the lag here was intensional
                #thats style u just dont get it
                #surely
                faceallsurface_changed = pygame.transform.scale(faceallsurface_changed,(256*facezoom,256*facezoom))
                faceeyesdetailsurface = pygame.transform.scale(faceeyesdetailsurface,(256*facezoom,256*facezoom))
                facemouthsurface_changed = pygame.transform.scale(facemouthsurface_changed,(256*facezoom,256*facezoom))

                shakemouth = 1
                
                eyedetailstate = True

                if animtimems >= 1280:
                    facemouthsurface_changed = pygame.transform.scale(facemouthclosedsurface,(256*facezoom,256*facezoom))
                else: 
                    facemouthsurface_changed = pygame.transform.scale(facemouthopenedsurface,(256*facezoom,256*facezoom))
            if animtimems in range(1440,1600): #THE
                shakemouth = 1
                if animtimems >= 1520:
                    facemouthsurface_changed = pygame.transform.scale(facemouthclosedsurface,(256*facezoom,256*facezoom))
                else: 
                    facemouthsurface_changed = pygame.transform.scale(facemouthopenedsurface,(256*facezoom,256*facezoom))
            if animtimems in range(1600,1920): #FUCK
                shakeface = abs((animtimems-1600) / 320)
                shakemouth = 2
                if animtimems >= 1840:
                    facemouthsurface_changed = pygame.transform.scale(facemouthclosedsurface,(256*facezoom,256*facezoom))
                else: 
                    facemouthsurface_changed = pygame.transform.scale(facemouthopenedsurface,(256*facezoom,256*facezoom))
            if animtimems in range(1920,2100): #UP!
                shakeface = 2
                shakemouth = 3
                facemouthsurface_changed = pygame.transform.scale(facemouthopenedsurface,(256*facezoom,256*facezoom))
            
            if animtimems in range(2560,3840): # transition
                x = random.randint(0,desktopres[0])
                y = random.randint(0,desktopres[1])
                pygame.draw.line(window,(0,0,0),(x-500,y),
                                                (x+500,y),15)

            

            pygame.display.update()

            for event in pygame.event.get():
                pass
        except ZeroDivisionError:
            continue

def fadein1600ms(Startingtime):
    global window
    global desktopres
    global windowres

    window.fill((0,0,0))
    pygame.display.update()

    animtime = 0

    while animtime <= 1.600:

        animtime = time.perf_counter() - Startingtime

        animtimems = int(animtime*1000)

        
        if animtimems in range(0,640):
            x = random.randint(0,desktopres[0])
            y = random.randint(0,desktopres[1])
            pygame.draw.line(window,(0,255,0),(x,y-100),
                                              (x,y+100),15)
            
        if animtimems in range(640,1280):
            windowscale = abs((animtimems-1280)/640)

            #500x250 new window
            x = desktopres[0]-500
            y = desktopres[1]-250

            windowres = [int(500+(x*windowscale)),int(250+(y*windowscale))]

            window = pygame.display.set_mode((windowres[0],windowres[1]), pygame.NOFRAME | pygame.SRCALPHA)
            window.fill((0,255,0))
            num = 0
            while num < 50:
                x = random.randint(0,windowres[0])
                y = random.randint(0,windowres[1])
                pygame.draw.line(window,(0,0,0),(x-50,y),
                                                (x+50,y),5)

                num += 1

            pygame.display.set_window_position(((desktopres[0]//2)-(windowres[0]//2),
                                                (desktopres[1]//2)-(windowres[1]//2)))
            pygame.draw.lines(window,(128,128,128),False,[(0,0),(windowres[0]-1,0),(windowres[0]-1,windowres[1]-1),(0,windowres[1]-1),(0,0)])
        
        pygame.display.update()

        for event in pygame.event.get():
            pass
        


def windowtextanim(Startingtime):
    global window
    global desktopres
    global windowres

    animtime = 0

    windowmovingmult = [0,0]
    windowcycle = True
    windowcycletime = 0 #0 - 2560

    shakeintensity = 0

    #16 beats 320bpm   cycle
    while animtime <= 100:

        animtime = time.perf_counter() - Startingtime

        animtimems = int(animtime*1000)
        
        if windowcycle:
            windowcycletime = animtimems % 2560
            
            x = (desktopres[0]//2)-(windowres[0]//2)-(windowmovingmult[0]*(desktopres[0]-windowres[0]))+(random.randint(-50,50)*shakeintensity)
            y = (desktopres[1]//2)-(windowres[1]//2)-(windowmovingmult[1]*(desktopres[1]-windowres[1]))+(random.randint(-50,50)*shakeintensity)
            pygame.display.set_window_position((x,y))
            if windowcycletime in range(0,1):
                pass


        pygame.display.update()

        for event in pygame.event.get():
            pass







def START(date_leftto_date1_print,time_leftto_date1_print,startoffsetsec):
    global DOGMATICArenderednum
    global cinemapart

    global window
    global desktopres

    global files

    global pawsurface
    global pawmirrorsurface

    global facebasesurface
    global faceeyesbasesurface
    global faceeyesdetailsurface
    global facemouthclosedsurface
    global facemouthopenedsurface

    #360 bpm (x2) = 0.16 sec

    dir_to_file_FOLDER = os.path.dirname(os.path.realpath(__file__)).replace('/','\\')
    files = {
    'song': dir_to_file_FOLDER+'\\Data\\DOGMATICA.mp3',
    'paw': dir_to_file_FOLDER+'\\Data\\dogmatica paw (i cant draw bro waaah waaaaah).png',
    'pawmirror': dir_to_file_FOLDER+'\\Data\\dogmatica paw (i cant draw bro waaah waaaaah) mirrored.png',

    'facebase': dir_to_file_FOLDER+'\\Data\\dogmatica face base.png',
    'faceeyesbase': dir_to_file_FOLDER+'\\Data\\dogmatica face eyes base.png',
    'faceeyesdetail': dir_to_file_FOLDER+'\\Data\\dogmatica face eyes detail.png',
    'facemouthclosed': dir_to_file_FOLDER+'\\Data\\dogmatica face mouth closed.png',
    'facemouthopened': dir_to_file_FOLDER+'\\Data\\dogmatica face mouth opened.png',
         }
    
    

    pygame.mixer.init()

    pygame.display.init()

    desktopres = pygame.display.get_desktop_sizes()[0]
    
    window = pygame.display.set_mode(desktopres, pygame.NOFRAME | pygame.SRCALPHA)
    window.fill((0,255,0))
    pygame.display.update()
    windowinfo = pygame.display.get_wm_info()["window"]

    import win32api
    import win32con
    import win32gui
    win32gui.SetWindowLong(windowinfo, 
                           win32con.GWL_EXSTYLE,
                           win32gui.GetWindowLong(windowinfo, win32con.GWL_EXSTYLE) | win32con.WS_EX_LAYERED | win32con.WS_EX_TOOLWINDOW)
    win32gui.SetLayeredWindowAttributes(windowinfo, win32api.RGB(*(0,255,0)), 0, win32con.LWA_COLORKEY)

    
    pawsurface = pygame.transform.scale(pygame.image.load(files['paw']),(desktopres[1],desktopres[1]))
    pawmirrorsurface = pygame.transform.scale(pygame.image.load(files['pawmirror']),(desktopres[1],desktopres[1]))
    facebasesurface = pygame.image.load(files['facebase'])
    faceeyesbasesurface = pygame.image.load(files['faceeyesbase'])
    faceeyesdetailsurface = pygame.image.load(files['faceeyesdetail'])
    facemouthclosedsurface = pygame.image.load(files['facemouthclosed'])
    facemouthopenedsurface = pygame.image.load(files['facemouthopened'])


    pygame.mixer_music.load(dir_to_file_FOLDER+'\\Data\\DOGMATICA.mp3')
    pygame.mixer_music.play()
    pygame.mixer_music.set_volume(0.5)
    pygame.mixer_music.set_pos(startoffsetsec)

    songSTARTtime = time.perf_counter() - startoffsetsec


    win32gui.ShowWindow(windowinfo, win32con.HWND_TOPMOST)
    rect = win32gui.GetWindowRect(windowinfo) 
    x = rect[0]
    y = rect[1]
    w = rect[2] - x
    h = rect[3] - y
    win32gui.SetWindowPos(windowinfo, win32con.HWND_TOPMOST, x,y,w,h, 0)

            
    while True:
        time.sleep(0.01)

        songpos = time.perf_counter() - songSTARTtime
        DOGMATICAlyricnum = int(songpos // 0.16)
        
        match cinemapart:
            case False:
                if DOGMATICAlyricnum >= 400:
                    cinemapart = True
                if DOGMATICAlyricnum != DOGMATICArenderednum:
                    try:
                        dogmaticalyric_nums[DOGMATICAlyricnum]
                        os.system('cls||clear')
                        print('Time left:\n'+date_leftto_date1_print+' '+time_leftto_date1_print)
                        print('\n')
                        print(dogmaticalyric_nums[DOGMATICAlyricnum])
                    except KeyError:
                        pass
                    DOGMATICArenderednum = DOGMATICAlyricnum
            case True:
                fourthwallbreak(time.perf_counter())
                fadein1600ms(time.perf_counter())
                time.sleep(10)



        for event in pygame.event.get():
            pass




if __name__ == '__main__':
    START('','',60)


